🚀&nbsp; env0 had composed a PR Plan for environment [Karl / env0-demos blocks / IGW_Route ](https://app.env0.com/p/07e24ae9-65b0-40b8-b360-5a9228323add/environments/0e14221e-b753-4402-bf01-8c817816edf2?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # aws_route.default_internet_route will be created
+   resource "aws_route" "default_internet_route" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = "igw-0e658f8b9a7af2e39"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # aws_route_table.public will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "public-routes"
        }
+       tags_all         = {
+           "Name" = "public-routes"
        }
+       vpc_id           = "vpc-087da6d6cbe1b8b66"
    }

  # aws_route_table_association.public_subnet_association will be created
+   resource "aws_route_table_association" "public_subnet_association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = "subnet-08ef3541c23c643ee"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/07e24ae9-65b0-40b8-b360-5a9228323add/environments/0e14221e-b753-4402-bf01-8c817816edf2/deployments/af89cdd6-6d3b-413b-8f1d-50548e036122?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[![env0-ai-summary-banner](https://app.env0.com/images/vcs-comment-ai-summary-banner.png)](https://app.env0.com/p/07e24ae9-65b0-40b8-b360-5a9228323add/environments/0e14221e-b753-4402-bf01-8c817816edf2/deployments/af89cdd6-6d3b-413b-8f1d-50548e036122?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)